test_case/ZalesakDisc/structured/0/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField #codeStream
{
    codeInclude
    #{
          #include "fvCFD.H"
    #};

    codeOptions
    #{
          -I$(LIB_SRC)/finiteVolume/lnInclude \
          -I$(LIB_SRC)/meshTools/lnInclude
    #};

    code
    #{
          const IOdictionary& d = static_cast<const IOdictionary&>(dict);
          const fvMesh& mesh = refCast<const fvMesh>(d.db());
          const scalar pi = Foam::constant::mathematical::pi;
          scalarField alpha(mesh.nCells(), 0.0);
          const scalar dx = pow(average(mesh.V()), scalar(1)/scalar(3)).value();
          const scalar width = dx * 1.5;
          const scalar nsub = 100;

          for(scalar del = -width; del < width; del += 2.0*width / nsub) 
          {
          forAll(alpha, i)
          {
               const scalar x = mesh.C()[i][0];
//               const scalar y = mesh.C()[i][1];
               const scalar z = mesh.C()[i][2];
               const scalar cx = x - 0.5;
               const scalar cz = z - 0.75;
               const scalar rr = sqrt(cx*cx + cz*cz);

               if ( (rr <= 0.15 +del) && ((fabs(cx) >= 0.025 -del) || (cz >= 0.10 -del)))
               {
/*
                    scalar h1 = 0.5*(1.0 - tanh(pi/width * (rr - 0.150)));
                    scalar h2 = (cz < 0.10 && cx > 0.0 ? 0.5*(1.0 + tanh(pi/width * (cx - 0.025))) : 1.0);
                    scalar h3 = (cz < 0.10 && cx < 0.0 ? 0.5*(1.0 - tanh(pi/width * (cx + 0.025))) : 1.0);
                    scalar h4 = (fabs(cx) < 0.025 ? 0.5*(1.0 + tanh(pi/width * (cz - 0.100))) : 1.0);
                    scalar hh = ::min(h1, ::min(h2, ::min(h3, h4)));
*/
                    scalar hh = 0.5 / width * (1.0 + cos(pi*del/width));
                    alpha[i] += hh;
               }
          }
          }
          const scalar maxA = max(alpha);
          forAll(alpha, i)
          {
              alpha[i] /= maxA;
          }
          alpha.writeEntry("", os);
    #};   
};

boundaryField
{
    "(bottom|left)"
    {
        type            zeroGradient;
    }
    "(top|right)"
    {
        type            zeroGradient;
    }
    "(front|back)"
    {
        type            empty;
    }
}

// ************************************************************************* //
